## 예시 2개의 숫자의 합

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql="SELECT userFunc(100,200);"

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0
0  300

## 출생년도-->나이 출력되는 함수

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql="SELECT getAgeFunc(1998);"

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0
0  25

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql="SELECT getAgeFunc(1998) INTO @age1998;"
sql1='SELECT getAgeFunc(2003) INTO @age2003;'
sql2="SELECT CONCAT('여동생과의 나이차==>',(@age1998-@age2003));"

In [23]:
cur_1.execute(sql)
cur_1.execute(sql1)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1

               0
0  여동생과의 나이차==>5